In [2]:
#Q1
import pandas as pd
data1 = {
    "Series":[4,8,15,16,23,42]
    
}
df1 = pd.DataFrame(data1)
df1

   Series
0       4
1       8
2      15
3      16
4      23
5      42

In [3]:
#Q2
names = ["Ayush", "Aman", "Rohit", "Suraj", "Priyanshu", "Vishal", "Ananay", "Shailesh", "Prashant", "Tilak"]
data2 = {
"Names":names
}
df2 = pd.DataFrame(data2)
df2

       Names
0      Ayush
1       Aman
2      Rohit
3      Suraj
4  Priyanshu
5     Vishal
6     Ananay
7   Shailesh
8   Prashant
9      Tilak

In [4]:
#Q3
data3 = {
"Name":['Alice', 'Bob', 'Claire'],
    "Age":[25, 30, 27],
    "Gender":['Femle','Male','Female']
}
df3 = pd.DataFrame(data3)
df3

     Name  Age  Gender
0   Alice   25   Femle
1     Bob   30    Male
2  Claire   27  Female

In [5]:
#Q4
'''
DataFrame in pandas:

A DataFrame is a 2-dimensional data structure in pandas that represents data in a tabular form, similar to a spreadsheet or SQL table. It consists of rows and columns, where each column can contain different data types. DataFrames are one of the most commonly used data structures in pandas, and they provide a powerful and flexible way to manipulate and analyze data.

Series in pandas:

A Series is a 1-dimensional data structure in pandas that represents a labeled array. It can hold data of any type, similar to a NumPy array, but it also has an associated index that labels each element in the Series. The index allows for easy and efficient access to elements based on labels.'''
import pandas as pd

# Example DataFrame
data = {
    'Name': ['John', 'Jane', 'Mike'],
    'Age': [25, 30, 22],
    'City': ['New York', 'San Francisco', 'Chicago']
}

df = pd.DataFrame(data)
print(df)
'''
In this example, we create a DataFrame df containing three columns: 'Name', 'Age', and 'City'. Each column is a pandas Series with its own data type and an index. The DataFrame allows us to organize this data in a tabular form with row and column labels.'''

   Name  Age           City
0  John   25       New York
1  Jane   30  San Francisco
2  Mike   22        Chicago

"\nIn this example, we create a DataFrame df containing three columns: 'Name', 'Age', and 'City'. Each column is a pandas Series with its own data type and an index. The DataFrame allows us to organize this data in a tabular form with row and column labels."

In [6]:
#Q5
'''
Some common functions to manipulate data in a Pandas DataFrame are:

1.head() and tail(): These functions allow you to view the first few rows (head()) or the last few rows (tail()) of the DataFrame.
'''
# Example:
print(df.head(3))  # Display the first 3 rows of the DataFrame.

# 2.info(): This function provides a concise summary of the DataFrame, including the data types, non-null values, and memory usage.
# Example:
df.info()


# describe(): This function generates descriptive statistics of the DataFrame, such as mean, count, min, max, etc.
# Example:
# Example:
print(df.describe())


# sort_values(): This function allows you to sort the DataFrame based on one or more columns.
# Example:
sorted_df = df.sort_values(by='Age', ascending=False)
print(sorted_df)


# groupby(): This function is used to group the DataFrame based on one or more columns and perform operations on those groups.
# Example:
grouped_df = df.groupby('City')['Age'].mean()
print(grouped_df)

   Name  Age           City
0  John   25       New York
1  Jane   30  San Francisco
2  Mike   22        Chicago
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes
             Age
count   3.000000
mean   25.666667
std     4.041452
min    22.000000
25%    23.500000
50%    25.000000
75%    27.500000
max    30.000000
   Name  Age           City
1  Jane   30  San Francisco
0  John   25       New York
2  Mike   22        Chicago
City
Chicago          22.0
New York         25.0
San Francisco    30.0
Name: Age, dtype: float64

In [7]:
#Q6
'''
In pandas, both Series and DataFrame are mutable in nature, meaning you can modify their contents after creation.
You can update the elements, add or delete rows/columns in a DataFrame or Series.'''

'\nIn pandas, both Series and DataFrame are mutable in nature, meaning you can modify their contents after creation.\nYou can update the elements, add or delete rows/columns in a DataFrame or Series.'

In [8]:
#Q7
import pandas as pd

# Create individual Series
names = pd.Series(['John', 'Jane', 'Mike'])
ages = pd.Series([25, 30, 22])
cities = pd.Series(['New York', 'San Francisco', 'Chicago'])

# Combine the Series into a DataFrame
df = pd.DataFrame({'Name': names, 'Age': ages, 'City': cities})

# Print the DataFrame
print(df)

   Name  Age           City
0  John   25       New York
1  Jane   30  San Francisco
2  Mike   22        Chicago